#pragma once

#include <cstdint>

namespace ymd::ral::stm32::stm32f30x_hrtim{

struct [[nodiscard]] R32_MCR{
    uint32_t CKPSC:3;//0~2
    uint32_t CONT:1;//3

    uint32_t RETRIG:1;//4
    uint32_t HALF:1;//5

    uint32_t :2;

    uint32_t SYNC_IN_0:1;//8
    uint32_t SYNC_IN_1:1;//9

    uint32_t SYNCRSTM:1;//10
    uint32_t SYNCSTRTM:1;//11

    uint32_t SYNC_OUT_0:1;//12
    uint32_t SYNC_OUT_1:1;//13

    uint32_t SYNC_SRC_0:1;//14
    uint32_t SYNC_SRC_1:1;//15

    uint32_t MCEN:1;//16
    uint32_t TACEN:1;//17
    uint32_t TBCEN:1;//18
    uint32_t TCCEN:1;//19
    uint32_t TDCEN:1;//20
    uint32_t TECEN:1;//21

    uint32_t :3;//22~24   
    uint32_t DACSYNC_0;//25
    uint32_t DACSYNC_1;//26

    uint32_t PREEN:1;//26
    uint32_t :1;
    uint32_t MREPU:1;//26

    uint32_t BRSTDMA_0:1;//30
    uint32_t BRSTDMA_1:1;//31
};

struct [[nodiscard]] R32_MISR{
    uint32_t MCMP1:1;
    uint32_t MCMP2:1;
    uint32_t MCMP3:1;
    uint32_t MCMP4:1;
    uint32_t MREP:1;
    uint32_t SYNC:1;
    uint32_t MUPD:1;

    uint32_t :29;
};

struct [[nodiscard]] R32_MICR{
    uint32_t MCMP1C:1;
    uint32_t MCMP2C:1;
    uint32_t MCMP3C:1;
    uint32_t MCMP4C:1;

    uint32_t MCMPC:1;
    uint32_t SYNCC:1;
    uint32_t MUPDC:1;

    uint32_t :29;
};

struct [[nodiscard]] R32_MDIER{
    uint32_t MCMP1IE:1;
    uint32_t MCMP2IE:1;
    uint32_t MCMP3IE:1;
    uint32_t MCMP4IE:1;
    uint32_t MREPIE:1;

    uint32_t SYNCIE:1;
    uint32_t MUPDIE:1;

    uint32_t :10;

    uint32_t MCMP1DE:1;
    uint32_t MCMP2DE:1;
    uint32_t MCMP3DE:1;
    uint32_t MCMP4DE:1;
    uint32_t MREPDE:1;

    uint32_t SYNCDE:1;
    uint32_t MUPDDE:1;
    uint32_t :10;
};

// struct [[nodiscard]] R32_MCNTR{
//     uint32_t MCNT:16;
//     uint32_t :16;
// };

// struct [[nodiscard]] R32_MPER{
